CSI API ETABS v1

# cAreaObjSetGUID Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetGUID(
    	string Name,
    	string GUID = ""
    )

    Function SetGUID (
    	Name As String,
    	Optional GUID As String = ""
    ) As Integer

    Dim instance As cAreaObj
    Dim Name As String
    Dim GUID As String
    Dim returnValue As Integer

    returnValue = instance.SetGUID(Name, GUID)

    int SetGUID(
    	String^ Name,
    	String^ GUID = L""
    )

    abstract SetGUID :
            Name : string *
            ?GUID : string
    (* Defaults:
            let _GUID = defaultArg GUID ""
    *)
    -> int

#### Parameters

Name

    Type: SystemString

GUID (Optional)

    Type: SystemString

#### Return Value

Type: Int32

See Also

#### Reference

cAreaObj Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com